app/views/orders/_order.html.erb

SELECT "items".* FROM "items" INNER JOIN "items_orders" ON "items"."id" = "items_orders"."item_id" WHERE "items_orders"."order_id" = $1  [["order_id", 5]]
---
    <tbody>
      <% order.items.each do |item| %>