app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("city", "created_at", "state", "street_name", "street_number", "updated_at", "user_id", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @address = Address.new(address_params)
    @address.user = current_user
    if @address.save

UPDATE "addresses" SET "street_name" = $1, "street_number" = $2, "updated_at" = $3 WHERE "addresses"."id" = 3  [["street_name", "Good Street"], ["street_number", "7000"], ["updated_at", "2014-12-15 21:54:10.655528"]]
---
  def update
    respond_to do |format|
      if @address.update(address_params)

DELETE FROM "addresses" WHERE "addresses"."id" = $1  [["id", 8]]
---
  def destroy
    @address.destroy