app/controllers/cart_items_controller.rb

SELECT  "items".* FROM "items"  WHERE "items"."id" = $1 LIMIT 1  [["id", 6]]
---
  def create
    item = Item.find(params[:item_id])