app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("created_at", "description", "price", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-12-15 21:54:19.283348"], ["description", "Black gold"], ["price", "2.99"], ["title", "Coffee"], ["updated_at", "2014-12-15 21:54:19.283348"]]