app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "display_name", "email", "name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = $1, "name" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = 8  [["email", "newuser@email.com"], ["name", "newusername"], ["password_digest", "$2a$04$mrqZ2mkJ6790ee54vfNAHOEaRJQ6RuGujEs01D0AofAdnYebBYwSu"], ["updated_at", "2014-12-15 21:54:10.850546"]]